package ru.fivefourtyfive.wikimapper.data.datasource.remote

import ru.fivefourtyfive.wikimapper.data.datasource.implementation.remote.util.Value.RU
import ru.fivefourtyfive.wikimapper.domain.entity.*

object FakeData {

    fun getFort() = Place(
        id = 18307319,
        languageIso = RU,
        objectType = 1,
        languageId = 1,
        languageName = "Russian",
        title = "Форт \"Красная Горка\"",
        description = "Форт «Красная Горка» (Алексеевский) (в 1919 году переименован в «Краснофлотский») — один из двух мощных береговых фортов Кронштадтской позиции Морской крепости Петра Великого.\nВходил в состав мощной минно-артиллерийской позиции, надёжно защищавшей подступы к столице государства от подхода крупных кораблей противника. Нарушить эту систему обороны удалось только британским торпедным катерам, атаковавшим корабли, стоявшие в 1919 году на рейде Кронштадта. Этот эпизод явился одной из причин категорического отказа моряков-балтийцев выполнить указания большевистского руководства об уничтожении флота, что переросло вскоре в Кронштадтское восстание под лозунгом «Советы без большевиков».\nСтроительство под руководством генерал-майора Аполлона Алексеевича Шишкина было начато в 1909 году одновременно с фортом Ино (Николаевским) и закончено к 1915 году. Назван по деревне Красная Горка (ныне поселок Красная Горка), рядом с которой находится.\nФорт вошел в строй в начале 1914 года. К началу первой мировой войны гарнизон форта был укомплектован по штатам военного времени (2000 артиллеристов, 2000 пехотинцев и более 500 военнослужащих других родов войск). В боевых действиях первой мировой войны форт участия не принимал.\nК январю 1917 года гарнизон форта возрос до 5500 человек. В 1918 году в связи с близостью германской армии форт был заминирован. Взрыв был отменен, но заряды не были убраны. 19 августа во время сильной грозы несколько зарядов сдетонировало. На воздух взлетели пороховые погреба трех орудий Канэ и четырех 254-мм орудий. Артиллерийская прислуга погибла, орудия были сильно повреждены, а одно 254-мм орудие уничтожено.\nВо время Гражданской войны форт входил в систему оборонительных укреплений «красного» Петрограда. К этому времени на форте имелось 25 орудий калибра от 76 до 305 мм. Во время боевых действий форт открывал огонь по противнику: 20 ноября 1918 года по захваченной финнами батарее «Пуммола», ранее входившей в систему укрепления форта «Ино», 29 июня 1919 года по транспортному судну противника.\n13 июня 1919 года, во время наступления на Петроград Северного корпуса генерала А.П. Родзянко, гарнизон форта поднял антибольшевистское восстание, которое было подавлено огнём и десантом с кораблей Балтийского флота (по форту было выпущено более 600 12\" снарядов). Восставшие оборонялись, обстреливая Кронштадт и корабли красного Балтийского флота. 16 июня красноармейцы вошли в оставленный восставшими форт. Белая армия не смогла воспользоваться переходом форта на сторону белых, т. к. белые узнали о восстании только на третий день — день, когда восстание было ликвидировано.\n30 октября 1919 года форт вступил в артиллерийскую дуэль с английским монитором «Эребус» (англ. HMS Erebus), выполнявшим робкую и запоздалую огневую поддержку Британским флотом наступления армии Юденича.\nВ 1921 году орудия «Красной горки» вели огонь по Кронштадту, подавляя антибольшевисткое восстание.\n30 ноября 1939 года в 8 часов 3 минуты утра форт в числе других батарей Кронштадта открыл огонь по финским укреплениям «Линии Маннергейма». Однако без корректировки огонь был неэффективен, и вскоре стрельба была прекращена.\nВо время Великой Отечественной войны форт стал центром обороны Ораниенбаумского плацдарма. Радиус действия его орудий фактически определял дальность расположения немецких позиций. Вокруг форта были проложены железнодорожные пути, по которым на специальных транспортерах перемещались крупнокалиберные корабельные орудия (356-, 305-, 180-мм).\nПосле войны форт некоторое время поддерживался в боеготовом состоянии, потом его помещения использовали в качестве складов, а затем почти полностью забросили.\nВ 2007 году совместо с муниципальными властями Лебяжьего, Ломоносовского района и Ленинградской области военные моряки решили в ближайшее время создать музей на месте легендарного форта.\nВесной 2012 года муниципальными властями Лебяжьего, Ломоносовского района и Ленинградской области взят курс на уничтожение этого шедевра русской фортификации, а также исключения его из списка культурных объектов Всемирного наследия ЮНЕСКО.\nБатарея 8×11\" гаубиц\nБатарея 8×10\" орудий\nБатарея 6×6\" орудий Канэ\nБатарея 4×12\" орудия в открытых установках\nБатарея 4×12\" орудия в двухорудийных башнях\n\nФорт является одним из культурных объектов Всемирного наследия ЮНЕСКО с 1990 года.\n\nhttp://www.lenww2.ru/index.php/region01/area11?id=1074\nhttp://www.krasnaya-gorka.sbor.ru/fort/fort.htm\n\nКак это уничтожается и разворовывается в наше время.\n Текст и ссылки на варварские действия по объекту. В основном касается государственных органов.\nhttps://vitjko.livejournal.com/63191.html",
        wikipedia = "http://ru.wikipedia.org/wiki/Красная_Горка_(форт)",
        isBuilding = false,
        isRegion = false,
        isDeleted = false,
        tags = listOf(
            Tag(196, "Вторая мировая война"),
            Tag(1147, "Первая мировая война"),
            Tag(2750, "оборонительное сооружение"),
            Tag(6413, "артиллерийская батарея"),
            Tag(44858, "объект всемирного наследия ЮНЕСКО")
        ),
        photos = listOf(
            Photo(
                id = 1449250,
                size = 105297,
                status = 0,
                objectId = 18307319,
                userId = 799076,
                userName = "miraru1",
                time = 1292502478,
                timeString = "11 лет назад",
                lastUserId = 799076,
                lastUserName = "miraru1",
                url960 = "http://photos.wikimapia.org/p/00/01/44/92/50_960.jpg",
                url1280 = "http://photos.wikimapia.org/p/00/01/44/92/50_1280.jpg",
                urlBig = "http://photos.wikimapia.org/p/00/01/44/92/50_big.jpg",
                thumbnailUrl = "http://photos.wikimapia.org/p/00/01/44/92/50_75.jpg",
                thumbnailRetinaUrl = "http://photos.wikimapia.org/p/00/01/44/92/50_75@2x.jpg"
            ),
            Photo(
                id = 2560539,
                size = 4247643,
                status = 0,
                objectId = 18307319,
                userId = 0,
                userName = "Guest",
                time = 1341073199,
                timeString = "9 лет назад",
                lastUserId = 0,
                lastUserName = "Guest",
                userIp = "0",
                fullUrl = "http://photos.wikimapia.org/p/00/02/56/05/39_full.jpg",
                url960 = "http://photos.wikimapia.org/p/00/02/56/05/39_960.jpg",
                url1280 = "http://photos.wikimapia.org/p/00/02/56/05/39_1280.jpg",
                urlBig = "http://photos.wikimapia.org/p/00/02/56/05/39_big.jpg",
                thumbnailUrl = "http://photos.wikimapia.org/p/00/02/56/05/39_75.jpg",
                thumbnailRetinaUrl = "http://photos.wikimapia.org/p/00/02/56/05/39_75@2x.jpg"
            )
        ),
        comments = listOf(
            Comment(
                placeId = 18307319,
                num = 1,
                langId = 1,
                userId = 0,
                userIp = -1293120350,
                userPhoto = "",
                name = "fcts2009",
                message = "Фото устарели,сейчас нет колючки,орудия покрашены,доступ открыт!Отличное место для любителей истории,не хуже бункеров линии Мажино или Атлантического Вала Гитлера!Проблема только добраться,дорог нет,распутица...",
                good = 0,
                bad = 1,
                block = false,
                date = 1411164683,
                moderUid = 0,
                moderatorName = null,
                isDeleted = false
            ),
            Comment(
                placeId = 18307319,
                num = 2,
                langId = 1,
                userId = 2363734,
                userIp = -720032043,
                userPhoto = "/img/nofoto_50.png",
                name = "FotosergS",
                message = "Форт \"Красная Горка\" (подробный фотоальбом): \r\nhttps://fotki.yandex.ru/users/fotosergs/album/140144/",
                good = 0,
                bad = 0,
                block = false,
                date = 1440790244,
                moderUid = 0,
                moderatorName = null,
                isDeleted = false
            )
        ),
        parentId = 0,
        x = 293234754, // /10_000_000
        y = 599717006,
        square = 21222.0
    )

    fun getDefenceLine() = Place(
        id = 11867376,
        objectType = 1,
        languageId = 1,
        languageIso = RU,
        languageName = "Russian",
        title = "Сухопутная оборона форта \"Красная Горка\"",
        description = "Внешний обвод сухопутной обороны форта \\\"Красная Горка\\\" (\\\"Алексеевский\\\", \\\"Краснофлотский\\\"). Состоит из:\\n- 15 артиллерийских позиций с для выкатных 3-дм/20 противоштурмовых пушек обр. 1903 г. с укрытиями и погребами боезапаса для пушек и 50 чел. л/с;\\n- 4 пулеметных гнезд на два пулемета с укрытиями и погребами боезапаса для пулеметов и 30 чел. л/с;\\n- 1 четырехпулеметного капонира с укрытием для личного состава;\\n- 4 сборных пулеметных железобетонных огневых точек, так называемых тяжелых пулеметных гнезд системы Колотовкина (Колотовского) (установленных позднее, в конце 1920-х гг.).\\n\\nВсе сооружения, кроме ЖБОТов построены в 1910-15 гг.\\n\\nУчастки между артиллерийскими и пулеметными позициями частично перекрыты бетонированными окопами с брустверами из бетона и брони (броня не сохранилась), частично — окопами полного профиля с валами. Пространство перед линией обороны было защищено рвом с эскарпом и 4-6 рядами колючей проволоки на железных кольях-надолбах (в основном, утрачены). Болото перед фортом при необходимости могло быть подтоплено на высоту ок. 3 м, для чего имеется шлюз затопления.\\n\\nВ тылу расположены 5 казарм-убежищ на 120 чел. с брустверами для стрелков.\\n\\nhttp://www.lenww2.ru/index.php/region01/area11?id=1074\\nhttp://www.krasnaya-gorka.sbor.ru/index.html",
        wikipedia = "",
        isBuilding = false,
        isRegion = false,
        isDeleted = false,
        tags = listOf(
            Tag(1147, "Первая мировая война"),
            Tag(2750, "оборонительное сооружение"),
        ),
        parentId = 0,
        x = 293363824,
        y = 599710642,
        square = 8952.9750083422,
        photos = listOf(
            Photo(
                id = 1708706,
                size = 205768,
                status = 0,
                objectId = 11867376,
                userId = 0,
                userName = "Guest",
                time = 1306615916,
                timeString = "10 лет назад",
                lastUserId = 0,
                lastUserName = "Guest",
                userIp = "0",
                url960 = "http://photos.wikimapia.org/p/00/01/70/87/06_960.jpg",
                url1280 = "http://photos.wikimapia.org/p/00/01/70/87/06_1280.jpg",
                urlBig = "http://photos.wikimapia.org/p/00/01/70/87/06_big.jpg",
                thumbnailUrl = "http://photos.wikimapia.org/p/00/01/70/87/06_75.jpg",
                thumbnailRetinaUrl = "http://photos.wikimapia.org/p/00/01/70/87/06_75@2x.jpg"
            ),
            Photo(
                id = 1708707,
                size = 225292,
                status = 0,
                objectId = 11867376,
                userId = 0,
                userName = "Guest",
                time = 1306615949,
                timeString = "10 лет назад",
                lastUserId = 0,
                lastUserName = "Guest",
                userIp = "0",
                url960 = "http://photos.wikimapia.org/p/00/01/70/87/07_960.jpg",
                url1280 = "http://photos.wikimapia.org/p/00/01/70/87/07_1280.jpg",
                urlBig = "http://photos.wikimapia.org/p/00/01/70/87/07_big.jpg",
                thumbnailUrl = "http://photos.wikimapia.org/p/00/01/70/87/07_75.jpg",
                thumbnailRetinaUrl = "http://photos.wikimapia.org/p/00/01/70/87/07_75@2x.jpg"
            )
        ),
        comments = listOf(
            Comment(
                placeId = 11867376,
                num = 1,
                langId = 1,
                userId = 56155,
                userIp = 1547518165,
                userPhoto = "/img/nofoto_50.png",
                name = "ruspodplav",
                message = "Эт сухопутная оборона форта.",
                good = 4,
                bad = 0,
                block = false,
                date = 1249158887,
                moderUid = 0,
                moderatorName = null,
                isDeleted = false
            ),
            Comment(
                placeId = 11867376,
                num = 2,
                langId = 1,
                userId = 0,
                userIp = -1304221335,
                userPhoto = "",
                name = "Glebr",
                message = "Оборонительная линия впечатляет! \n",
                good = 2,
                bad = 0,
                block = false,
                date = 1294861729,
                moderUid = 0,
                moderatorName = null,
                isDeleted = false
            )
        )
    )

    fun getArea() = Area(places = listOf(getFort(), getDefenceLine()))

    fun getPlaceError() = Place(debugInfo = DebugInfo(0, "ERROR: Place not found!"))

    fun getAreaError() = Area(debugInfo = DebugInfo(0, "TEST AREA ERROR"))
}